Update docs formatting and fix links for GitHub
